Revit 2027 API
MEPAnalyticalSegment.SegmentType Property
 The analytical segment type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPAnalyticalSegmentType SegmentType { get; }
Public ReadOnly Property SegmentType As MEPAnalyticalSegmentType
	Get
public:
property MEPAnalyticalSegmentType SegmentType {
	MEPAnalyticalSegmentType get ();
}
member SegmentType : MEPAnalyticalSegmentType with get
Property Value
MEPAnalyticalSegmentType
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace